Feat: Logging added
